package 메서드;

public class EX00메서드 {

	/* public    static    int       sum       (int a, int b) {
	// 1)접근제한자 2)저장소 3)리턴타입 4)메서드명(호출명) 5)(매개변수)
						//*소괄호를 포함하고 있는 애들은 다 메서드다.
						//매개변수(parameter): 메서드 안에서 사용될 변수 정의
						//반드시 선언까지만 작성해야 한다.
						//매개변수가 필요 없다면 빈 소괄호만()오면된다.
			
			int result = a+b;
			return result;
		//리턴은 결과값을 호출한 곳으로 돌려주는 기능을 가지고 있다.
		//돌려주고 메서드를 종료시킨다.  
		//***리턴타입(데이터타입)이 명시되어 있을 경우 반드시 return 필요
		//void의 경우 생략이 가능하다. 

		 */
	
	public static void main(String[] args) {
		
		//sum   (5,10);
		//호출명  전달인자(argument)
		
		//사용은 메인안에서 실행한다.
		//반드시 호출명() 필요
		
		
		
  }
			
	}

	//매개,전달
	// 1) 매개2개 -> 전달2개
	//		3개->3개
	// 2)데이터타입이 같아야한다.
	//매 string,int -> 전 string,int
	// 순서도 지켜줘야함
	



